In [30]:
#Data structures
import pandas as pd
import numpy as np

In [16]:
#Series
# converting tuple to Series
h = ('AA', '2012-02-01', 100, 10.2)
s = pd.Series(h)
type(s)

pandas.core.series.Series

In [17]:
print(s)

0            AA
1    2012-02-01
2           100
3          10.2
dtype: object

In [18]:
# converting dict to Series
d = {'name' : 'IBM', 'date' : '2010-09-08', 'shares' : 100, 'price' : 10.2}
ds = pd.Series(d)
type(ds)

pandas.core.series.Series

In [19]:
print(ds)

name             IBM
date      2010-09-08
shares           100
price           10.2
dtype: object

In [20]:
f = ['FB', '2001-08-02', 90, 3.2]
f = pd.Series(f, index = ['name', 'date', 'shares', 'price'])
print(f)

name              FB
date      2001-08-02
shares            90
price            3.2
dtype: object

In [21]:
f['shares']

90

In [22]:
f[0]

'FB'

In [23]:
f[['shares', 'price']]

shares     90
price     3.2
dtype: object

In [27]:
#Day 8
#Creating series from scalar
s = pd.Series(50, index=[0,1,2,3,4])
print(s)

0    50
1    50
2    50
3    50
4    50
dtype: int64

In [28]:
#Mathematical Operations in Series
s = pd.Series([1,2,3,4,5])
print("To multiply all values in the series by 2")
print("------------------------------------------")
print(s*2)
print("To find the square of all values in the series")
print("------------------------------------------")
print(s**2)
print("To print all values in a series that are greater than 2")
print("------------------------------------------")
print(s[s>2])

To multiply all values in the series by 2
------------------------------------------
0     2
1     4
2     6
3     8
4    10
dtype: int64
To find the square of all values in the series
------------------------------------------
0     1
1     4
2     9
3    16
4    25
dtype: int64
To print all values in a series that are greater than 2
------------------------------------------
2    3
3    4
4    5
dtype: int64

In [29]:
s1 = pd.Series([1,2,3,4,5], index= ['a','b','c','d','e'])
s2 = pd.Series([10,20,30,40,50], index= ['a','b','c','d','e'])
s3 = pd.Series([5,14,23,32], index= ['a','b','c','d'])
print("To add Series1 & series2")
print("------------------------------------------")
print(s1+s2)
print("To add Series2 & series3")
print("------------------------------------------")
print(s2+s3)
print("To add Series2 & series3 and Filled Non Matching Index with 0")
print("------------------------------------------")
print(s2.add(s3,fill_value=0))

To add Series1 & series2
------------------------------------------
a    11
b    22
c    33
d    44
e    55
dtype: int64
To add Series2 & series3
------------------------------------------
a    15.0
b    34.0
c    53.0
d    72.0
e     NaN
dtype: float64
To add Series2 & series3 and Filled Non Matching Index with 0
------------------------------------------
a    15.0
b    34.0
c    53.0
d    72.0
e    50.0
dtype: float64

In [36]:
#selecting in series
arr = np.array([10,15,18,22,55,77])
s = pd.Series(arr)
print(s)
print("------------------------")
print(s.loc[:2])
print(s.iloc[:2])

print("------------------------")
print(s.loc[3:4])
print(s.iloc[3:4])
print("------------------------")
s.loc[2:3]
print("------------------------")
s.iloc[2:3]
print(s[1])
print("\n")
print(s[3:4])
s[:3]

0    10
1    15
2    18
3    22
4    55
5    77
dtype: int32
------------------------
0    10
1    15
2    18
dtype: int32
0    10
1    15
dtype: int32
------------------------
3    22
4    55
dtype: int32
3    22
dtype: int32
------------------------
------------------------
15


3    22
dtype: int32

0    10
1    15
2    18
dtype: int32

In [37]:
#Indexing in Series
arr= np.array(['a','b','c','d'])
s = pd.Series(arr,index=['first','second','third','fourth'])
print(s)
#To print only indexes in series
print('\n indexes in Series are:::')
s.index

first     a
second    b
third     c
fourth    d
dtype: object

 indexes in Series are:::

Index(['first', 'second', 'third', 'fourth'], dtype='object')

In [39]:
#Slicing in Series
arr = np.array([10,15,18,22,55,77])
s = pd.Series(arr, index=['A','B','C','D','E','F'])
print(s)
print(s[1:5:2])
print(s[0:6:2])

A    10
B    15
C    18
D    22
E    55
F    77
dtype: int32
B    15
D    22
dtype: int32
A    10
C    18
E    55
dtype: int32

In [42]:
#Dataframes
data = { 'name' : ['AA', 'IBM', 'GOOG'],
'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],
'shares' : [100, 30, 90],
'price' : [12.3, 10.3, 32.2]
}
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [43]:
df

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [46]:
df['owner']= 'Unknown'
df

   name        date  shares  price    owner
0    AA  2001-12-01     100   12.3  Unknown
1   IBM  2012-02-10      30   10.3  Unknown
2  GOOG  2010-04-09      90   32.2  Unknown

In [47]:
df.index=['one','two','three']
df

       name        date  shares  price    owner
one      AA  2001-12-01     100   12.3  Unknown
two     IBM  2012-02-10      30   10.3  Unknown
three  GOOG  2010-04-09      90   32.2  Unknown

In [48]:
df= df.set_index(['name'])
df

            date  shares  price    owner
name
AA    2001-12-01     100   12.3  Unknown
IBM   2012-02-10      30   10.3  Unknown
GOOG  2010-04-09      90   32.2  Unknown

In [49]:
# access data using column-index
df['shares']

name
AA      100
IBM      30
GOOG     90
Name: shares, dtype: int64

In [52]:
# access data by row-index
#df.ix['AA']